Revit 2027 API
ParameterTypeId.FabricationServiceParam Property
 "Fabrication Service"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationServiceParam { get; }
Public Shared ReadOnly Property FabricationServiceParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationServiceParam {
	ForgeTypeId^ get ();
}
static member FabricationServiceParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace